project1-resources/run-grid-coarse-KVLCC2-SA-stampede2/0.org/nutSST
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    side 
    {
        type            calculated;
        value           $internalField;
    }
    sym 
    {
        type            symmetryPlane;
    }
    bot
    {
        type            calculated;
        value           $internalField;
    }
    top
    {
        type            calculated;
        value           $internalField;
    }
    hull
    {
        type            nutkWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
