project1-resources/run-grid-coarse-KVLCC2-SA-stampede2/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0.org 0

runApplication blockMesh

runApplication decomposePar -copyZero
runParallel snappyHexMesh -overwrite

runParallel $(getApplication)

runApplication reconstructParMesh -constant
runApplication reconstructPar -latestTime
